# is, ==    сравнивает ID ДВУХ ЗНАЧЕНИЙ
# in проверяют, есть ли заданное значение или переменная в строке, списке, кортеже, множестве или словаре

# ==========================================  IN  ===================================================
# с помощью in мы можем проверить находится ли элемент в этом кортеже
a=1,2,3
b=tuple((1,2,3))
c=()
d=tuple()
    # True     False     True
print(2 in a, 5 in a, 6 not in a)   # выводит ответ bool, true or false



# =========================================  IS  ====================================================
# is b ==
a=(2,3,4)
b=(2,3,4)
print( a is b, a==b)   # True потому что кортеж не изменяемый тип данных

b=[2,3,4]
b.append(23) # [2,3,4,23]
a=[2,3,4]
print( a is b, a==b)   # False  потому что список изменяемый тип данных



