# 1-задание: перевернуть строку "phew" -> "wehp"___________________________________________________________________________________

# перевернутая копия строки
str = "phew" [::-1]
print(str)

# с помощью встроенной функции reversed
str=''.join(reversed('phew'))
print(str)


# 2 - задание: ____________________________________________________________________________________________________________________
# У list - списка очень много методов потому что он изменяеиый, можно изменять элементы в списке. А у кортежа всего лишь два метода,
# потому что он не изменямый тип. 

# метод Append ===========================================================================================================
# добавляет элемент в конец списка

numbers=['one','two','three']
numbers.append('four')
print(numbers)

# добавляет список в сущ.список
names=['Tom','Leonardo']
family_names=('Hanks', 'DiCaprio')
names.append(family_names)
print(names)

# метод Count ==============================================================================================================
# показывает сколько раз был показан заданный элемент в списке
numbers = [1, 2, 3, 3, 4]
x = numbers.count(3)
print(x)

names=["Tom", "Leo", "Tom"]
x=names.count("Tom")
print(x)

# метод Copy ================================================================================================================== 
seasons=['winter', 'spring', 'summer', 'autumn']
x=seasons.copy()
print(x)

# метод Insert ================================================================================================================ 
# добавляет элемент в определенную позицию
seasons=['winter', 'summer', 'autumn']
seasons.insert(1, 'spring')
print(seasons)

# метод Sort ================================================================================================================== 
#сортирование списка в алфавитном порядке
fruits=['banana', 'apple', 'orange']
fruits.sort()
print(fruits)


# метод Extend ================================================================================================================
# добавление двух списков в один
fruits=['banana', 'apple', 'orange']
berries=['strawberry', 'raspberry', 'cherry']
fruits.extend(berries)
print(fruits)

# метод pop ================================================================================================================
# убирает элемент с заданной позиции  если ничего не писать никакой индекс, он удалит последнее значение
# remove удаляет 

berries=['strawberry', 'raspberry', 'cherry']
berries.pop(2)
print(berries)

# выводит выбранный элемент
berries=['strawberry', 'raspberry', 'cherry']
x=berries.pop(2)
print(x)

# метод index ==============================================================================================================
# показывает под каким индексом находится определ.элемент
berries=['strawberry', 'raspberry', 'cherry']
x=berries.index('raspberry')
print(x)

# возвращает индекс первого вхождения указанного элемента

berries=['strawberry', 'raspberry', 'cherry', 'strawberry']
x=berries.index('strawberry')
print(x)



